## DNS
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 2 to add, 0 to change, 2 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                         NAME                          |
|--------|-------------------------------------------------------|
| add    | `aws_route53_record.resources-alpha-canada-ca-CNAME`  |
|        | `aws_route53_record.ressources-alpha-canada-ca-CNAME` |
| delete | `aws_route53_record.resources-alpha-canada-ca-NS`     |
|        | `aws_route53_record.ressources-alpha-canada-ca-NS`    |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # aws_route53_record.resources-alpha-canada-ca-CNAME will be created
  + resource "aws_route53_record" "resources-alpha-canada-ca-CNAME" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "resources.alpha.canada.ca"
      + records         = [
          + "cds-snc.github.io",
        ]
      + ttl             = 1800
      + type            = "CNAME"
      + zone_id         = "Z33C47YI9EN8XL"
    }

  # aws_route53_record.resources-alpha-canada-ca-NS will be destroyed
  # (because aws_route53_record.resources-alpha-canada-ca-NS is not in configuration)
  - resource "aws_route53_record" "resources-alpha-canada-ca-NS" {
      - fqdn                             = "resources.alpha.canada.ca" -> null
      - id                               = "Z33C47YI9EN8XL_resources.alpha.canada.ca_NS" -> null
      - multivalue_answer_routing_policy = false -> null
      - name                             = "resources.alpha.canada.ca" -> null
      - records                          = [
          - "ns-1128.awsdns-13.org",
          - "ns-1655.awsdns-14.co.uk",
          - "ns-419.awsdns-52.com",
          - "ns-663.awsdns-18.net",
        ] -> null
      - ttl                              = 300 -> null
      - type                             = "NS" -> null
      - zone_id                          = "Z33C47YI9EN8XL" -> null
    }

  # aws_route53_record.ressources-alpha-canada-ca-CNAME will be created
  + resource "aws_route53_record" "ressources-alpha-canada-ca-CNAME" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "ressources.alpha.canada.ca"
      + records         = [
          + "cds-snc.github.io",
        ]
      + ttl             = 1800
      + type            = "CNAME"
      + zone_id         = "Z33C47YI9EN8XL"
    }

  # aws_route53_record.ressources-alpha-canada-ca-NS will be destroyed
  # (because aws_route53_record.ressources-alpha-canada-ca-NS is not in configuration)
  - resource "aws_route53_record" "ressources-alpha-canada-ca-NS" {
      - fqdn                             = "ressources.alpha.canada.ca" -> null
      - id                               = "Z33C47YI9EN8XL_ressources.alpha.canada.ca_NS" -> null
      - multivalue_answer_routing_policy = false -> null
      - name                             = "ressources.alpha.canada.ca" -> null
      - records                          = [
          - "ns-101.awsdns-12.com",
          - "ns-1251.awsdns-28.org",
          - "ns-1955.awsdns-52.co.uk",
          - "ns-648.awsdns-17.net",
        ] -> null
      - ttl                              = 300 -> null
      - type                             = "NS" -> null
      - zone_id                          = "Z33C47YI9EN8XL" -> null
    }

Plan: 2 to add, 0 to change, 2 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_route53_zone.alpha-canada-ca-public"]
WARN - plan.json - main - Missing Common Tags: ["aws_route53_zone.cds-snc-ca-public"]
WARN - plan.json - main - Missing Common Tags: ["aws_route53_zone.notification-canada-ca-public"]

20 tests, 17 passed, 3 warnings, 0 failures, 0 exceptions

```

</details>
